Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: ContainerRegistry|GitLab is unable to validate this signature automatically. Validate the signature manually before trusting it.
sv: GitLab kan inte validera den här signaturen automatiskt. Validera signaturen manuellt innan du litar på den.

source: ContainerRegistry|Image repository deletion failed
sv: Det gick inte att ta bort avbildningslagringsplatsen

source: ContainerRegistry|Image repository temporarily cannot be marked for deletion. Please try again in a few minutes. %{docLinkStart}More details%{docLinkEnd}
sv: Avbildningslagringsplatsen kan tillfälligt inte markeras för borttagning. Försök igen om några minuter. %{docLinkStart}Mer information%{docLinkEnd}

source: ContainerRegistry|Image repository will be deleted
sv: Avbildningslagringsplatsen kommer att tas bort

source: ContainerRegistry|Image repository with no name located at the project URL.
sv: Avbildningslagringsplats utan namn på projektets URL.

source: ContainerRegistry|Image tags
sv: Avbildningstaggar

source: ContainerRegistry|Immutable
sv: Oföränderlig

source: ContainerRegistry|Includes both tagged and untagged images
sv: Innehåller både taggade och otaggade avbildningar

source: ContainerRegistry|Invalid tag: missing manifest digest
sv: Ogiltig tagg: manifestets sammandrag saknas

source: ContainerRegistry|Keep tags matching:
sv: Behåll taggar som matchar:

source: ContainerRegistry|Keep the most recent:
sv: Behåll de senaste:

source: ContainerRegistry|Keep these tags
sv: Behåll dessa taggar

source: ContainerRegistry|Last published at %{time}
sv: Senast publicerad %{time}

source: ContainerRegistry|Manifest digest: %{digest}
sv: Manifestets sammandrag: %{digest}

source: ContainerRegistry|Manifest media type: %{mediaType}
sv: Medietyp för manifest: %{mediaType}

source: ContainerRegistry|Maximum number of rules reached.
sv: Maximalt antal regler har nåtts.

source: ContainerRegistry|Minimum access level for delete
sv: Minsta åtkomstnivå för borttagning

source: ContainerRegistry|Minimum access level for push
sv: Minsta åtkomstnivå för push

source: ContainerRegistry|Minimum access level to delete
sv: Minsta åtkomstnivå för borttagning

source: ContainerRegistry|Minimum access level to push
sv: Minsta åtkomstnivå för push

source: ContainerRegistry|Minimum role allowed to delete
sv: Minsta roll som får ta bort

source: ContainerRegistry|Minimum role allowed to push
sv: Minsta roll som får pusha

source: ContainerRegistry|Minimum role to delete:
sv: Minsta roll för borttagning:

source: ContainerRegistry|Minimum role to push:
sv: Minsta roll för push:

source: ContainerRegistry|Missing or insufficient permission, delete button disabled
sv: Behörighet saknas eller är otillräcklig, borttagningsknappen är inaktiverad

source: ContainerRegistry|Must be less than 100 characters.
sv: Måste vara kortare än 100 tecken.

source: ContainerRegistry|Next cleanup scheduled to run on:
sv: Nästa rensning är schemalagd till:

source: ContainerRegistry|No container image tags are protected.
sv: Inga taggar för behållaravbildningar är skyddade.

source: ContainerRegistry|No container repositories are protected.
sv: Inga behållarlagringsplatser är skyddade.

source: ContainerRegistry|None
sv: Ingen

source: ContainerRegistry|Not yet scheduled
sv: Inte schemalagd ännu

source: ContainerRegistry|Note: Any policy update will result in a change to the scheduled run date and time
sv: Obs: Varje ändring av principen ändrar datum och tid för den schemalagda körningen

source: ContainerRegistry|Only users with at least this role can delete tags with a name that matches the protection rule.
sv: Endast användare med minst denna roll kan ta bort taggar med namn som matchar skyddsregeln.

source: ContainerRegistry|Only users with at least this role can push tags with a name that matches the protection rule.
sv: Endast användare med minst denna roll kan pusha taggar med namn som matchar skyddsregeln.

source: ContainerRegistry|Partial cleanup complete
sv: Delvis rensning slutförd

source: ContainerRegistry|Path pattern with %{linkStart}wildcards%{linkEnd} such as `my-scope/my-container-*` are supported.
sv: Sökvägsmönster med %{linkStart}jokertecken%{linkEnd}, till exempel `my-scope/my-container-*`, stöds.

source: ContainerRegistry|Protect container tags matching
sv: Skydda behållartaggar som matchar

source: ContainerRegistry|Protected container image tags
sv: Skyddade taggar för behållaravbildningar

source: ContainerRegistry|Protected container repositories
sv: Skyddade behållarlagringsplatser

source: ContainerRegistry|Protection rule created.
sv: Skyddsregel har skapats.

source: ContainerRegistry|Protection type
sv: Skyddstyp

source: ContainerRegistry|Published to the %{repositoryPath} image repository on %{dateTime}
sv: Publicerades till avbildningslagringsplatsen %{repositoryPath} den %{dateTime}

source: ContainerRegistry|Push an image
sv: Pusha en avbildning

source: ContainerRegistry|Registry cleanup disabled. Either no cleanup policies are enabled, or this project has no container images.
sv: Registerrensning är inaktiverad. Antingen är inga rensningsprinciper aktiverade eller så har projektet inga behållaravbildningar.

source: ContainerRegistry|Regular expression without the \A and \z anchors.
sv: Reguljärt uttryck utan ankaren \A och \z.

source: ContainerRegistry|Remember to run %{docLinkStart}garbage collection%{docLinkEnd} to remove the stale data from storage.
sv: Kom ihåg att köra %{docLinkStart}skräpinsamling%{docLinkEnd} för att ta bort inaktuella data från lagringen.

source: ContainerRegistry|Remove repository
sv: Ta bort lagringsplats

source: ContainerRegistry|Remove tags matching:
sv: Ta bort taggar som matchar:

source: ContainerRegistry|Remove tags older than:
sv: Ta bort taggar äldre än:

source: ContainerRegistry|Remove these tags
sv: Ta bort dessa taggar

source: ContainerRegistry|Repository path pattern
sv: Sökvägsmönster för lagringsplats

source: ContainerRegistry|Run cleanup:
sv: Kör rensning:

source: ContainerRegistry|Save storage space by automatically deleting tags from the container registry and keeping the ones you want. %{linkStart}How does cleanup work?%{linkEnd}
sv: Spara lagringsutrymme genom att automatiskt ta bort taggar från behållarregistret och behålla dem du vill ha. %{linkStart}Så fungerar rensning%{linkEnd}

source: ContainerRegistry|Select tag
sv: Välj tagg

source: ContainerRegistry|Set cleanup rules
sv: Ange rensningsregler

source: ContainerRegistry|Set up cleanup
sv: Konfigurera rensning

source: ContainerRegistry|Show full path
sv: Visa fullständig sökväg

source: ContainerRegistry|Signature digest: %{digest}
sv: Signaturens sammandrag: %{digest}

source: ContainerRegistry|Something went wrong while fetching the cleanup policy.
sv: Något gick fel när rensningsprincipen skulle hämtas.

source: ContainerRegistry|Something went wrong while fetching the image details.
sv: Något gick fel när avbildningsinformationen skulle hämtas.

source: ContainerRegistry|Something went wrong while fetching the repository list.
sv: Något gick fel när listan över lagringsplatser skulle hämtas.

source: ContainerRegistry|Something went wrong while marking the tag for deletion.
sv: Något gick fel när taggen skulle markeras för borttagning.

source: ContainerRegistry|Something went wrong while marking the tags for deletion.
sv: Något gick fel när taggarna skulle markeras för borttagning.

source: ContainerRegistry|Something went wrong while saving the protection rule.
sv: Något gick fel när skyddsregeln skulle sparas.

source: ContainerRegistry|Something went wrong while scheduling %{title} for deletion. Please try again.
sv: Något gick fel när %{title} skulle schemaläggas för borttagning. Försök igen.

source: ContainerRegistry|Something went wrong while scheduling the image for deletion.
sv: Något gick fel när avbildningen skulle schemaläggas för borttagning.

source: ContainerRegistry|Something went wrong while updating the cleanup policy.
sv: Något gick fel när rensningsprincipen skulle uppdateras.

source: ContainerRegistry|Sorry, your filter produced no results.
sv: Tyvärr gav filtret inga resultat.

source: ContainerRegistry|Supported platforms: %{supportedPlatforms}
sv: Plattformar som stöds: %{supportedPlatforms}

source: ContainerRegistry|Tag pattern
sv: Taggmönster

source: ContainerRegistry|Tag successfully marked for deletion.
sv: Taggen har markerats för borttagning.

source: ContainerRegistry|Tags successfully marked for deletion.
sv: Taggarna har markerats för borttagning.

source: ContainerRegistry|Tags that match %{strongStart}all%{strongEnd} these rules are %{strongStart}removed%{strongEnd}, unless they match %{strongStart}any%{strongEnd} keep rules above.
sv: Taggar som matchar %{strongStart}alla%{strongEnd} dessa regler %{strongStart}tas bort%{strongEnd}, om de inte matchar %{strongStart}någon%{strongEnd} behållregel ovan.

source: ContainerRegistry|Tags with names that match this regex pattern are immutable. Must be less than 100 characters. %{linkStart}What regex patterns are supported?%{linkEnd}
sv: Taggar med namn som matchar det här reguljära uttrycket är oföränderliga. Måste vara kortare än 100 tecken. %{linkStart}Vilka reguljära uttryck stöds?%{linkEnd}

source: ContainerRegistry|Tags with names that match this regex pattern are kept. %{linkStart}View regex examples.%{linkEnd}
sv: Taggar med namn som matchar det här reguljära uttrycket behålls. %{linkStart}Visa exempel på reguljära uttryck.%{linkEnd}

source: ContainerRegistry|Tags with names that match this regex pattern are protected. Must be less than 100 characters. %{linkStart}What regex patterns are supported?%{linkEnd}
sv: Taggar med namn som matchar det här reguljära uttrycket är skyddade. Måste vara kortare än 100 tecken. %{linkStart}Vilka reguljära uttryck stöds?%{linkEnd}

source: ContainerRegistry|Tags with names that match this regex pattern are removed. %{linkStart}View regex examples.%{linkEnd}
sv: Taggar med namn som matchar det här reguljära uttrycket tas bort. %{linkStart}Visa exempel på reguljära uttryck.%{linkEnd}

source: ContainerRegistry|The cleanup will continue within %{time}. %{linkStart}Learn more%{linkEnd}
sv: Rensningen fortsätter om %{time}. %{linkStart}Läs mer%{linkEnd}

source: ContainerRegistry|The image repository could not be found.
sv: Avbildningslagringsplatsen kunde inte hittas.

source: ContainerRegistry|The requested image repository does not exist or has been deleted. If you think this is an error, try refreshing the page.
sv: Den begärda avbildningslagringsplatsen finns inte eller har tagits bort. Om du tror att detta är ett fel kan du försöka uppdatera sidan.

source: ContainerRegistry|The value of this input should be less than 256 characters
sv: Värdet i det här fältet ska vara kortare än 256 tecken

source: ContainerRegistry|There are no container images available in this group
sv: Det finns inga behållaravbildningar i den här gruppen

source: ContainerRegistry|There are no container images stored for this project
sv: Det finns inga behållaravbildningar lagrade för det här projektet

source: ContainerRegistry|This container image tag cannot be overwritten or deleted.
sv: Taggen för behållaravbildningen kan inte skrivas över eller tas bort.

source: ContainerRegistry|This field is required.
sv: Det här fältet är obligatoriskt.

source: ContainerRegistry|This image has no active tags
sv: Den här avbildningen har inga aktiva taggar

source: ContainerRegistry|This image repository has failed to be deleted
sv: Det gick inte att ta bort avbildningslagringsplatsen

source: ContainerRegistry|This image repository is scheduled for deletion
sv: Avbildningslagringsplatsen är schemalagd för borttagning

source: ContainerRegistry|This image repository will be deleted. %{linkStart}Learn more.%{linkEnd}
sv: Avbildningslagringsplatsen kommer att tas bort. %{linkStart}Läs mer.%{linkEnd}

source: ContainerRegistry|This project's cleanup policy for tags is not enabled.
sv: Projektets rensningsprincip för taggar är inte aktiverad.

source: ContainerRegistry|This tag is protected
sv: Den här taggen är skyddad

source: ContainerRegistry|To widen your search, change or remove the filters above.
sv: Om du vill utöka sökningen kan du ändra eller ta bort filtren ovan.

source: ContainerRegistry|Users with at least the Developer role for this project will be able to push and delete container images to this repository path.
sv: Användare med minst utvecklarrollen för det här projektet kan pusha och ta bort behållaravbildningar till den här lagringsplatssökvägen.

source: ContainerRegistry|When a container repository is protected, only users with specific roles can push and delete container images. This helps prevent unauthorized modifications.
sv: När en behållarlagringsplats är skyddad kan endast användare med specifika roller pusha och ta bort behållaravbildningar. Det hjälper till att förhindra obehöriga ändringar.

source: ContainerRegistry|While the rename is in progress, new uploads to the container registry are blocked. Ongoing uploads may fail and need to be retried.
sv: Medan namnbytet pågår blockeras nya uppladdningar till behållarregistret. Pågående uppladdningar kan misslyckas och behöver då göras om.

source: ContainerRegistry|With the container registry, every project can have its own space to store its Docker images. %{docLinkStart}More Information%{docLinkEnd}
sv: Med behållarregistret kan varje projekt ha ett eget utrymme för att lagra sina Docker-avbildningar. %{docLinkStart}Mer information%{docLinkEnd}

source: ContainerRegistry|You are about to delete the container repository protection rule for %{repositoryPathPattern}.
sv: Du är på väg att ta bort behållarens skyddsregel för lagringsplatsen %{repositoryPathPattern}.

source: ContainerRegistry|You are about to remove %{item} tags. Are you sure?
sv: Du är på väg att ta bort %{item} taggar. Är du säker?

source: ContainerRegistry|You are about to remove %{item}. Are you sure?
sv: Du är på väg att ta bort %{item}. Är du säker?

source: ContainerRegistry|You can add an image to this registry with the following commands:
sv: Du kan lägga till en avbildning i registret med följande kommandon:

source: ContainerRegistry|immutable
sv: oföränderlig

source: ContainerRegistry|index
sv: index

source: ContainerRegistry|protected
sv: skyddad

source: VirtualRegistryCacheEntry|Download count
sv: Antal nedladdningar

source: VirtualRegistryCacheEntry|Last checked
sv: Senast kontrollerad

source: VirtualRegistry|%{count} of %{max}
sv: %{count} av %{max}

source: VirtualRegistry|-- artifacts
sv: -- artefakter

source: VirtualRegistry|Actions
sv: Åtgärder

source: VirtualRegistry|Add upstream
sv: Lägg till uppströmskälla

source: VirtualRegistry|An error occurred while fetching virtual registries. Please try again.
sv: Det gick inte att hämta virtuella register. Försök igen.

source: VirtualRegistry|Are you sure you want to delete %{name}?
sv: Vill du ta bort %{name}?

source: VirtualRegistry|Are you sure you want to delete %{strongOpen}%{name}%{strongClose}?
sv: Vill du ta bort %{strongOpen}%{name}%{strongClose}?

source: VirtualRegistry|Artifact caching period
sv: Cachningsperiod för artefakter

source: VirtualRegistry|Cache cleanup completed for %{group_name}
sv: Cacheminnesrensningen är klar för %{group_name}

source: VirtualRegistry|Cache cleanup disabled. Next run is not scheduled.
sv: Cacheminnesrensning är inaktiverad. Nästa körning är inte schemalagd.

source: VirtualRegistry|Cache cleanup enabled. Next run scheduled for %{nextRun}.
sv: Cacheminnesrensning är aktiverad. Nästa körning är schemalagd till %{nextRun}.

source: VirtualRegistry|Cache cleanup failed for %{group_name}
sv: Cacheminnesrensningen misslyckades för %{group_name}

source: VirtualRegistry|Cache revalidation is disabled. Upstream URL is known to have immutable responses.
sv: Omvalidering av cacheminnet är inaktiverad. Uppströms-URL:en är känd för att ha oföränderliga svar.

source: VirtualRegistry|Clear all caches
sv: Rensa alla cacheminnen

source: VirtualRegistry|Clear all caches?
sv: Vill du rensa alla cacheminnen?

source: VirtualRegistry|Clear cache
sv: Rensa cacheminne

source: VirtualRegistry|Clear cache for %{upstreamName}?
sv: Vill du rensa cacheminnet för %{upstreamName}?

source: VirtualRegistry|Configure an upstream registry to manage Container artifacts and cache entries.
sv: Konfigurera ett uppströmsregister för att hantera behållarartefakter och cacheposter.

source: VirtualRegistry|Configure an upstream registry to manage Maven artifacts and cache entries.
sv: Konfigurera ett uppströmsregister för att hantera Maven-artefakter och cacheposter.

source: VirtualRegistry|Connect Container virtual registry to an upstream
sv: Anslut virtuellt behållarregister till en uppströmskälla

source: VirtualRegistry|Connect Maven virtual registry to an upstream
sv: Anslut virtuellt Maven-register till en uppströmskälla

source: VirtualRegistry|Connection successful.
sv: Anslutningen lyckades.

source: VirtualRegistry|Container
sv: Behållare

source: VirtualRegistry|Container virtual registries
sv: Virtuella behållarregister

source: VirtualRegistry|Container virtual registry not available
sv: Virtuellt behållarregister är inte tillgängligt

source: VirtualRegistry|Copy virtual registry ID: %{id}
sv: Kopiera virtuellt register-ID: %{id}

source: VirtualRegistry|Create new upstream
sv: Skapa ny uppströmskälla

source: VirtualRegistry|Create registry
sv: Skapa register

source: VirtualRegistry|Create upstream
sv: Skapa uppströmskälla

source: VirtualRegistry|Delete Container upstream cache entry?
sv: Vill du ta bort cacheposten för behållarens uppströmskälla?

source: VirtualRegistry|Delete Maven registry
sv: Ta bort Maven-register

source: VirtualRegistry|Delete Maven upstream cache entry?
sv: Vill du ta bort Maven-uppströmskällans cachepost?

source: VirtualRegistry|Delete registry
sv: Ta bort register

source: VirtualRegistry|Delete upstream
sv: Ta bort uppströmskälla

source: VirtualRegistry|Description
sv: Beskrivning

source: VirtualRegistry|Description (optional)
sv: Beskrivning (valfritt)

source: VirtualRegistry|Direct project membership no longer grants access to the Maven virtual registry. To access the virtual registry, you must be a member of the top-level group or an administrator.
sv: Direkt projektmedlemskap ger inte längre åtkomst till det virtuella Maven-registret. För att komma åt det virtuella registret måste du vara medlem i toppnivågruppen eller administratör.

source: VirtualRegistry|Disabling removes access. Existing registries are preserved and available again when re-enabled.
sv: Inaktivering tar bort åtkomsten. Befintliga register behålls och blir tillgängliga igen när funktionen aktiveras på nytt.

source: VirtualRegistry|Edit container virtual registry
sv: Redigera virtuellt behållarregister

source: VirtualRegistry|Edit registry
sv: Redigera register

source: VirtualRegistry|Edit registry %{name}
sv: Redigera registret %{name}

source: VirtualRegistry|Edit upstream
sv: Redigera uppströmskälla

source: VirtualRegistry|Edit upstream %{name}
sv: Redigera uppströmskällan %{name}

source: VirtualRegistry|Enable virtual registry
sv: Aktivera virtuellt register

source: VirtualRegistry|Enter a personal access token for GitLab-hosted upstreams.
sv: Ange en personlig åtkomsttoken för GitLab-hanterade uppströmskällor.

source: VirtualRegistry|Error:
sv: Fel:

source: VirtualRegistry|Failed to clear registry cache. Try again.
sv: Det gick inte att rensa registrets cacheminne. Försök igen.

source: VirtualRegistry|Failed to clear upstream cache. Try again.
sv: Det gick inte att rensa uppströmskällans cacheminne. Försök igen.

source: VirtualRegistry|Failed to connect %{msg}
sv: Det gick inte att ansluta %{msg}

source: VirtualRegistry|Failed to connect.
sv: Det gick inte att ansluta.

source: VirtualRegistry|Failed to delete cache entry.
sv: Det gick inte att ta bort cacheposten.

source: VirtualRegistry|Failed to delete registry. Please try again.
sv: Det gick inte att ta bort registret. Försök igen.

source: VirtualRegistry|Failed to fetch cache entries count.
sv: Det gick inte att hämta antalet cacheposter.

source: VirtualRegistry|Failed to fetch cache entries.
sv: Det gick inte att hämta cacheposter.

source: VirtualRegistry|Failed to fetch list of upstreams.
sv: Det gick inte att hämta listan över uppströmskällor.

source: VirtualRegistry|Failed to fetch list of virtual registries.
sv: Det gick inte att hämta listan över virtuella register.

source: VirtualRegistry|Failed to fetch registry details.
sv: Det gick inte att hämta registerinformationen.

source: VirtualRegistry|Failed to fetch upstream summary.
sv: Det gick inte att hämta sammanfattningen för uppströmskällan.

source: VirtualRegistry|Failed to fetch upstreams. Please try again.
sv: Det gick inte att hämta uppströmskällor. Försök igen.

source: VirtualRegistry|Failed to remove upstream. Try again.
sv: Det gick inte att ta bort uppströmskällan. Försök igen.

source: VirtualRegistry|Failed to update position of the upstream. Try again.
sv: Det gick inte att uppdatera uppströmskällans position. Försök igen.

source: VirtualRegistry|Get started with virtual registries
sv: Kom igång med virtuella register

source: VirtualRegistry|Hi %{username}!
sv: Hej %{username}!

source: VirtualRegistry|Last updated
sv: Senast uppdaterad

source: VirtualRegistry|Link existing upstream
sv: Länka befintlig uppströmskälla

source: VirtualRegistry|Manage packages across multiple sources and streamline development workflows using virtual registries.
sv: Hantera paket från flera källor och effektivisera utvecklingsarbetsflöden med virtuella register.

source: VirtualRegistry|Manage packages across multiple sources and streamline development workflows. %{linkStart}Learn more.%{linkEnd}
sv: Hantera paket från flera källor och effektivisera utvecklingsarbetsflöden. %{linkStart}Läs mer.%{linkEnd}

source: VirtualRegistry|Maven
sv: Maven

source: VirtualRegistry|Maven registries
sv: Maven-register

source: VirtualRegistry|Maven registries and upstreams
sv: Maven-register och uppströmskällor

source: VirtualRegistry|Maven upstream
sv: Maven-uppströmskälla

source: VirtualRegistry|Maven upstream has been deleted.
sv: Maven-uppströmskällan har tagits bort.

source: VirtualRegistry|Maven upstream has been updated.
sv: Maven-uppströmskällan har uppdaterats.

source: VirtualRegistry|Maven upstreams
sv: Maven-uppströmskällor

source: VirtualRegistry|Maven virtual registries
sv: Virtuella Maven-register

source: VirtualRegistry|Maven virtual registry not available
sv: Virtuellt Maven-register är inte tillgängligt

source: VirtualRegistry|Maven virtual registry was created
sv: Virtuellt Maven-register har skapats

source: VirtualRegistry|Maven virtual registry was deleted
sv: Virtuellt Maven-register har tagits bort

source: VirtualRegistry|Maven virtual registry was updated
sv: Virtuellt Maven-register har uppdaterats

source: VirtualRegistry|Maximum number of registries reached.
sv: Maximalt antal register har nåtts.

source: VirtualRegistry|Maximum number of upstreams reached.
sv: Maximalt antal uppströmskällor har nåtts.

source: VirtualRegistry|Metadata caching period
sv: Cachningsperiod för metadata

source: VirtualRegistry|Move upstream down
sv: Flytta uppströmskälla nedåt

source: VirtualRegistry|Move upstream up
sv: Flytta uppströmskälla uppåt

source: VirtualRegistry|Name
sv: Namn

source: VirtualRegistry|Name cannot be longer than %{length} characters.
sv: Namnet får inte vara längre än %{length} tecken.

source: VirtualRegistry|Name is required.
sv: Namn är obligatoriskt.

source: VirtualRegistry|New container virtual registry
sv: Nytt virtuellt behållarregister

source: VirtualRegistry|New maven virtual registry
sv: Nytt virtuellt Maven-register
